# EmployeeDept

Source: https://www.glassdoor.com/Interview/SQL-questions-A-table-schema-with-tables-like-employee-department-employee-to-projects-projects-1-Select-empl-QTN_1536586.htm

The following questions use the `employees` & `products` tables as given below.

In [2]:
%load_ext sql
%sql postgresql://fknight:@localhost/postgres

In [3]:
%%html
<style>
table {float:left}
</style>

In [22]:
%%sql

DROP TABLE IF EXISTS employees;
CREATE TABLE employees (
    id SERIAL PRIMARY KEY,
    name varchar,
    salary int,
    dept_id int
);

INSERT INTO employees 
  (name, salary, dept_id)
VALUES
  ('John',   20000, 1),
  ('Ava',    10000, 5),
  ('Cailin', 30000, 2),
  ('Mike',   20000, 2),
  ('Ian',    80000, 2),
  ('John',   50000, 3);

SELECT * FROM employees;

 * postgresql://fknight:***@localhost/postgres
Done.
Done.
6 rows affected.
6 rows affected.

[(1, 'John', 20000, 1),
 (2, 'Ava', 10000, 5),
 (3, 'Cailin', 30000, 2),
 (4, 'Mike', 20000, 2),
 (5, 'Ian', 80000, 2),
 (6, 'John', 50000, 3)]

In [30]:
%%sql

DROP TABLE IF EXISTS projects;
CREATE TABLE projects (
    id SERIAL PRIMARY KEY
);

INSERT INTO projects
VALUES
    (1),
    (2),
    (3);

DROP TABLE IF EXISTS employee_to_projects;
CREATE TABLE employee_to_projects (
    employee_id INT,
    project_id INT
);

INSERT INTO employee_to_projects
VALUES
    (1, 1),
    (2, 2),
    (4, 3),
    (5, 2);

 * postgresql://fknight:***@localhost/postgres
Done.
Done.
3 rows affected.
Done.
Done.
4 rows affected.

[]

# Part A

Select employee from departments where max salary of the department is 40k

# Type your SQL below

In [51]:
# %%sql
#
# Type your query here

# Part B

Select employee assigned to projects

# Type your SQL below

In [52]:
# %%sql
#
# Type your query here

# Part C

Select employee which have the max salary in a given department

# Type your SQL below

In [53]:
# %%sql
#
# Type your query here

# Part D

Select employee with second highest salary.

# Type your SQL below

In [54]:
# %%sql
#
# Type your query here